public/man/man1/pw-cli.1/index.html
<!DOCTYPE html>
<html
    lang="en-us"
    dir="ltr"
>
    <head>
        <meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Manpages - pw-cli.1 | Technical Notes</title>

      <link rel="stylesheet" href="/css/main.min.a9ecaac9d4f7845fc2de4738f7709cab0bd1c3d19c3466fadd637a6987603257.css" integrity="sha256-qeyqydT3hF/C3kc493CcqwvRw9GcNGb63WN6aYdgMlc=" crossorigin="anonymous">


<link rel="stylesheet" href="/css/syntax.css">
        
        
    </head>
    <body>
        <header class="container header">
            <span class="header__title">Technical Notes</span>
<button id="menuOpenBtn" class="header__menu-open-btn"><i data-lucide="menu"></i></button>

  <nav id="siteNav">
    <ul>
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/notes/">Notes</a>
    </li>
    <li>
      <a aria-current="true" class="ancestor" href="/man/">Manpages</a>
    </li>
    <li>
      <a href="/search/">Search</a>
    </li>
    </ul>
    <button id="menuCloseBtn" class="header__menu-close-btn"><i data-lucide="x"></i></button>
  </nav>


        </header>
        <main class="container">
            
    <h1>Manpages - pw-cli.1</h1>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
NAME
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>pw-cli - The PipeWire Command Line Interface</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
SYNOPSIS
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p><strong>pw-cli</strong> [/command/]</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
DESCRIPTION
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p>Interact with a PipeWire instance.</p>
<p>
When a command is given, <strong>pw-cli</strong> will execute the command and exit</p>
<p>
When no command is given, <strong>pw-cli</strong> starts an interactive session with
the default PipeWire instance <em>pipewire-0</em>.</p>
<p>
Connections to other, remote instances can be made. The current instance
name is displayed at the prompt.</p>
<p>
Note that <strong>pw-cli</strong> also creates a local PipeWire instance. Some commands
operate on the current (remote) instance and some on the local instance,
such as module loading.</p>
<p>
Use the &#39;help&#39; command to list the available commands.</p>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
GENERAL COMMANDS
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<p><strong>help | h</strong></p>
<blockquote>
<p>Show a quick help on the commands available. It also lists the aliases
for many commands.</p>
</blockquote>
<p>
<strong>quit | q</strong></p>
<blockquote>
<p>Exit from <strong>pw-cli</strong></p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">
MODULE MANAGEMENT
</h2>
<div id="outline-text-headline-5" class="outline-text-2">
<p>Modules are loaded and unloaded in the local instance, thus the pw-cli
binary itself and can add functionality or objects to the local
instance. It is not possible in PipeWire to load modules in another
instance.</p>
<p>
<strong>load-module */name/</strong> [*/arguments…/*]*</p>
<blockquote>
<p>Load a module specified by its name and arguments in the local instance.
For most modules it is OK to be loaded more than once.</p>
<p>
This command returns a module variable that can be used to unload the
module.</p>
<p>
The locally module is /not visible in the remote instance. It is not
possible in PipeWire to load modules in a remote instance. /</p>
</blockquote>
<p>
*unload-module */module-var/</p>
<blockquote>
<p>Unload a module, specified either by its variable.</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-6" class="outline-2">
<h2 id="headline-6">
OBJECT INTROSPECTION
</h2>
<div id="outline-text-headline-6" class="outline-text-2">
<p><strong>list-objects</strong></p>
<blockquote>
<p>List the objects of the current instance.</p>
</blockquote>
<p>
Objects are listed with their <em>id, type and version.</em></p>
<p>
<strong>info */id/</strong> | */all/</p>
<blockquote>
<p>Get information about a specific object or <em>all objects.</em></p>
</blockquote>
<p>
Requesting info about an object will also notify you of changes.</p>
</div>
</div>
<div id="outline-container-headline-7" class="outline-2">
<h2 id="headline-7">
WORKING WITH REMOTES
</h2>
<div id="outline-text-headline-7" class="outline-text-2">
<p><strong>connect [*/remote-name/*]</strong></p>
<blockquote>
<p>Connect to a remote instance and make this the new current instance.</p>
<p>
If no remote name is specified, a connection is made to the default
remote instance, usually <em>pipewire-0.</em></p>
<p>
The special remote name called <em>internal can be used to connect to the
local /*pw-cli*</em> PipeWire instance./</p>
<p>
This command returns a remote var that can be used to disconnect or
switch remotes.</p>
</blockquote>
<p>
<strong>disconnect [*/remote-var/*]</strong></p>
<blockquote>
<p>Disconnect from a <em>remote instance.</em></p>
<p>
If no remote name is specified, the current instance is disconnected.</p>
</blockquote>
<p>
<strong>list-remotes</strong></p>
<blockquote>
<p>List all <em>remote instances.</em></p>
</blockquote>
<p>
<strong>switch-remote [*/remote-var/*]</strong></p>
<blockquote>
<p>Make the specified <em>remote the current instance.</em></p>
<p>
If no remote name is specified, the first instance is made current.</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-8" class="outline-2">
<h2 id="headline-8">
NODE MANAGEMENT
</h2>
<div id="outline-text-headline-8" class="outline-text-2">
<p><strong>create-node */factory-name/</strong> [*/properties…/*]*</p>
<blockquote>
<p>Create a node from a factory in the current instance.</p>
<p>
Properties are key=value pairs separated by whitespace.</p>
<p>
This command returns a /node variable. /</p>
</blockquote>
<p>
<strong>export-node */node-id/</strong> [*/remote-var/*]*</p>
<blockquote>
<p>Export a node from the local instance to the specified instance. When no
instance is specified, the node will be exported to the current
instance.</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-9" class="outline-2">
<h2 id="headline-9">
DEVICE MANAGEMENT
</h2>
<div id="outline-text-headline-9" class="outline-text-2">
<p><strong>create-device */factory-name/</strong> [*/properties…/*]*</p>
<blockquote>
<p>Create a device from a factory in the current instance.</p>
<p>
Properties are key=value pairs separated by whitespace.</p>
<p>
This command returns a /device variable. /</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-10" class="outline-2">
<h2 id="headline-10">
LINK MANAGEMENT
</h2>
<div id="outline-text-headline-10" class="outline-text-2">
<p><strong>create-link */node-id/</strong> <strong><em>port-id</em></strong> <strong><em>node-id</em></strong> <strong><em>port-id</em></strong>
[*/properties…/*]*</p>
<blockquote>
<p>Create a link between 2 nodes and ports.</p>
<p>
Port <em>ids and Node ids can be set to /-</em> to automatically select a node
or a port./</p>
<p>
Port <em>ids can be /*</em> to automatically link matching ports ids in the
nodes./</p>
<p>
Properties are key=value pairs separated by whitespace.</p>
<p>
This command returns one or more /link variables. /</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-11" class="outline-2">
<h2 id="headline-11">
GLOBALS MANAGEMENT
</h2>
<div id="outline-text-headline-11" class="outline-text-2">
<p>*destroy */object-id/</p>
<blockquote>
<p>Destroy a global object.</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-12" class="outline-2">
<h2 id="headline-12">
PARAMETER MANAGEMENT
</h2>
<div id="outline-text-headline-12" class="outline-text-2">
<p><strong>enum-params */object-id/</strong> */param-id/</p>
<blockquote>
<p>Enumerate params of an object.</p>
<p>
/param-id can also be given as the param short name. /</p>
</blockquote>
<p>
<strong>set-param */object-id/</strong> <strong><em>param-id</em></strong> */param-json/</p>
<blockquote>
<p>Set param of an object.</p>
<p>
/param-id can also be given as the param short name. /</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-13" class="outline-2">
<h2 id="headline-13">
PERMISSION MANAGEMENT
</h2>
<div id="outline-text-headline-13" class="outline-text-2">
<p><strong>permissions */client-id/</strong> <strong><em>object-id</em></strong> */permission/</p>
<blockquote>
<p>Set permissions for a client.</p>
<p>
/object-id can be -1 to set the default permissions. /</p>
</blockquote>
<p>
*get-permissions */client-id/</p>
<blockquote>
<p>Get permissions of a client.</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-14" class="outline-2">
<h2 id="headline-14">
COMMAND MANAGEMENT
</h2>
<div id="outline-text-headline-14" class="outline-text-2">
<p>*send-command */object-id/</p>
<blockquote>
<p>Send a command to an object.</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-15" class="outline-2">
<h2 id="headline-15">
AUTHORS
</h2>
<div id="outline-text-headline-15" class="outline-text-2">
<p>The PipeWire Developers
&lt;<a href="https://gitlab.freedesktop.org/pipewire/pipewire/issues">https://gitlab.freedesktop.org/pipewire/pipewire/issues</a>&gt;; PipeWire is
available from &lt;<a href="https://pipewire.org">https://pipewire.org</a>&gt;</p>
</div>
</div>
<div id="outline-container-headline-16" class="outline-2">
<h2 id="headline-16">
SEE ALSO
</h2>
<div id="outline-text-headline-16" class="outline-text-2">
<p>*pipewire(1)*/, <em><strong>pw-mon(1)</strong></em>, /</p>
</div>
</div>


        </main>
        <footer class="container footer">
            <p>Copyright 2024. All rights reserved.</p>

        </footer>

        
        

        
            <script src="/js/main.95916b5b8c09add4922ea47e674b5da7fc4b6347a3e8c4e25e98b4b7d236080b.js" integrity="sha256-lZFrW4wJrdSSLqR&#43;Z0tdp/xLY0ej6MTiXpi0t9I2CAs=" crossorigin="anonymous"></script>
    </body>
</html>
